# Experiment No. 8

### Roll No.: 18BIC026 Joy Mehta

Date: 24/09/2020

## Aim: 
#### Support Vector Machines algorithm.

## Objectives:

> To implement Support Vector Machines algorithm.

### Pre-Lab Exercise:
1. Learn theoretical concepts related to Support Vector Machines algorithm.

### Reference Book:
1. Tom Mitchell, Machine Learning, TMH Publications.

# Programming Exercise:

##  Support Vector Machines

In [1]:
#importing needed libraries
import pandas as pd 
from sklearn import svm
from sklearn.model_selection import train_test_split
from sklearn.metrics import accuracy_score
from sklearn.metrics import confusion_matrix
from sklearn.model_selection import cross_val_score

In [2]:
#reading the dataset in to a dataframe
df = pd.read_csv("diab.csv")
df.head()

,no_preg,pg_conc,dia_bp,tri_sf_th,ser_ins,bmi,diab_ped,age,class_val,class
0,6,148,72,35,0,33.6,0.627,50,positive,1
1,1,85,66,29,0,26.6,0.351,31,negative,0
2,8,183,64,0,0,23.3,0.672,32,positive,1
3,1,89,66,23,94,28.1,0.167,21,negative,0
4,0,137,40,35,168,43.1,2.288,33,positive,1

In [3]:
#number of rows and columns
df.shape

(768, 10)

In [4]:
#dropping unwanted columns
#dropping class_val as it is similar to class
del df["class_val"]
df.head()

   no_preg  pg_conc  dia_bp  tri_sf_th  ser_ins   bmi  diab_ped  age  class
0        6      148      72         35        0  33.6     0.627   50      1
1        1       85      66         29        0  26.6     0.351   31      0
2        8      183      64          0        0  23.3     0.672   32      1
3        1       89      66         23       94  28.1     0.167   21      0
4        0      137      40         35      168  43.1     2.288   33      1

In [5]:
#number of output class
len(df["class"].unique())

2

In [6]:
#splitting dataset into train and train data
train, test = train_test_split(df, test_size=0.3)
#splitting the dataset into x and y
train_x = train.iloc[:, :-1]
train_y = train.iloc[:, -1:].values.ravel()
test_x = test.iloc[:, :-1]
test_y = test.iloc[:, -1:].values.ravel()
#shapes of each dataframe
print("Train_x =", train_x.shape)
print("Train_y =", train_y.shape)
print("Test_x =", test_x.shape)
print("Test_y", test_y.shape)

Train_x = (537, 8)
Train_y = (537,)
Test_x = (231, 8)
Test_y (231,)

In [7]:
#using cross validation
lov = [10, 1, 0.1]
cv_scores = []
for c in lov:
    clf = svm.SVC(kernel="linear", C=c)
    scores = cross_val_score(clf, train_x, train_y, cv=3, scoring="accuracy")
    print("C={:.2f} Accuracy={:.2f}(+/- {:.2f})".format(c, scores.mean(), scores.std() * 2))
    cv_scores.append(scores.mean())

C=10.00 Accuracy=0.76(+/- 0.06)
C=1.00 Accuracy=0.76(+/- 0.04)
C=0.10 Accuracy=0.76(+/- 0.06)

In [8]:
print(cv_scores)

[0.7560521415270017, 0.7635009310986964, 0.7560521415270017]

In [9]:
C = lov[cv_scores.index(max(cv_scores))]
print(C)

1

In [10]:
#model
svc = svm.SVC(kernel="linear", C=C).fit(train_x, train_y)

In [11]:
#prediction
pred_svc = svc.predict(test_x)

In [12]:
#accuracy
accuracy_score(test_y, pred_svc)

0.7705627705627706

In [13]:
#confusion_matrix
confusion_matrix(test_y, pred_svc)

array([[129,  19],
       [ 34,  49]])

## Applying SVM on different dataset
[Dataset Link](https://www.kaggle.com/krantiswalke/bank-personal-loan-modelling)

This dataset contains information that whether a person with given details will take a personal loan or not.

In [14]:
#reading the dataset
df1 = pd.read_csv("Bank_Personal_Loan_Modelling.csv")
df1.head()

,ID,Age,Experience,Income,ZIP Code,Family,CCAvg,Education,Mortgage,Personal Loan,Securities Account,CD Account,Online,CreditCard
0,1,25,1,49,91107,4,1.6,1,0,0,1,0,0,0
1,2,45,19,34,90089,3,1.5,1,0,0,1,0,0,0
2,3,39,15,11,94720,1,1.0,1,0,0,0,0,0,0
3,4,35,9,100,94112,1,2.7,2,0,0,0,0,0,0
4,5,35,8,45,91330,4,1.0,2,0,0,0,0,0,1

In [15]:
df1.columns
#here personal loan column is the output class

Index(['ID', 'Age', 'Experience', 'Income', 'ZIP Code', 'Family', 'CCAvg',
       'Education', 'Mortgage', 'Personal Loan', 'Securities Account',
       'CD Account', 'Online', 'CreditCard'],
      dtype='object')

In [16]:
#re arranging columns so that the output class is at the last for better accessibility
df1["personal_loan"] = df1["Personal Loan"]
del df1["Personal Loan"]
df1.head()

,ID,Age,Experience,Income,ZIP Code,Family,CCAvg,Education,Mortgage,Securities Account,CD Account,Online,CreditCard,personal_loan
0,1,25,1,49,91107,4,1.6,1,0,1,0,0,0,0
1,2,45,19,34,90089,3,1.5,1,0,1,0,0,0,0
2,3,39,15,11,94720,1,1.0,1,0,0,0,0,0,0
3,4,35,9,100,94112,1,2.7,2,0,0,0,0,0,0
4,5,35,8,45,91330,4,1.0,2,0,0,0,0,1,0

In [17]:
#dropping unwanted columns
#dropping id column as it is different for every person
del df1["ID"]
df1.head()

,Age,Experience,Income,ZIP Code,Family,CCAvg,Education,Mortgage,Securities Account,CD Account,Online,CreditCard,personal_loan
0,25,1,49,91107,4,1.6,1,0,1,0,0,0,0
1,45,19,34,90089,3,1.5,1,0,1,0,0,0,0
2,39,15,11,94720,1,1.0,1,0,0,0,0,0,0
3,35,9,100,94112,1,2.7,2,0,0,0,0,0,0
4,35,8,45,91330,4,1.0,2,0,0,0,0,1,0

In [18]:
#number of rows and columns
df1.shape

(5000, 13)

In [19]:
#number of output class
len(df1["personal_loan"].unique())

2

In [20]:
#splitting dataset into train and train data
train, test = train_test_split(df1, test_size=0.3)
#splitting the dataset into x and y
train_x = train.iloc[:, :-1]
train_y = train.iloc[:, -1:].values.ravel()
test_x = test.iloc[:, :-1]
test_y = test.iloc[:, -1:].values.ravel()
#shapes of each dataframe
print("Train_x =", train_x.shape)
print("Train_y =", train_y.shape)
print("Test_x =", test_x.shape)
print("Test_y", test_y.shape)

Train_x = (3500, 12)
Train_y = (3500,)
Test_x = (1500, 12)
Test_y (1500,)

In [21]:
#using cross validation
lov = [10, 1, 0.1]
cv_scores = []
for c in lov:
    clf = svm.SVC(kernel="linear", C=c)
    scores = cross_val_score(clf, train_x, train_y, cv=3, scoring="accuracy")
    print("C={:.2f} Accuracy={:.2f}(+/- {:.2f})".format(c, scores.mean(), scores.std() * 2))
    cv_scores.append(scores.mean())

C=10.00 Accuracy=0.91(+/- 0.02)
C=1.00 Accuracy=0.91(+/- 0.02)
C=0.10 Accuracy=0.91(+/- 0.02)

In [22]:
print(cv_scores)

[0.9114269238438614, 0.9099980255580004, 0.912568964613394]

In [23]:
C = lov[cv_scores.index(max(cv_scores))]
print(C)

0.1

In [24]:
#model
svc = svm.SVC(kernel="linear", C=C).fit(train_x, train_y)

In [25]:
#prediction
pred_svc = svc.predict(test_x)

In [26]:
#accuracy
accuracy_score(test_y, pred_svc)

0.9046666666666666

In [27]:
#confusion_matrix
confusion_matrix(test_y, pred_svc)

array([[1315,   38],
       [ 105,   42]])

# Conclusion
* In this lab we implemented the support vector machine algorithm using the sklearn library. First we implemented SVM on diabetes dataset and then I implemented it on a bank dataset where it predicted whether the person should will take a personal loan or not.
* In the diabetes dataset the accuracy obtained was `77.05%`.
* In the bank dataset the accuracy obtained was `90.46%`.
* The process for training SVM was similar to the kNN algorithm as this also included cross validation.